# Titanic Data

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("test.csv")

In [3]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Missingness

In [4]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

# 방법1: Fillna

### 0

In [5]:
df['Age'].fillna(0)

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     0.0
414    39.0
415    38.5
416     0.0
417     0.0
Name: Age, Length: 418, dtype: float64

### Mean

In [6]:
df['Age'].fillna(df['Age'].mean())

0      34.50000
1      47.00000
2      62.00000
3      27.00000
4      22.00000
         ...
413    30.27259
414    39.00000
415    38.50000
416    30.27259
417    30.27259
Name: Age, Length: 418, dtype: float64

# 방법2: SimpleImputer

In [7]:
from sklearn.impute import SimpleImputer

In [10]:
imputer = SimpleImputer(strategy='mean')

In [11]:
result = imputer.fit_transform(df[['Age']])

In [13]:
df['Age'] = result